QiuQQ151/STM32F103_TEMP/DRIVER/BSP/TFT2.8/GUI.c
#include "lcd.h"
#include "string.h"
#include "font.h" 
#include "delay.h"
#include "gui.h"

#include "stm32f10x.h"

#include "lcd.h"         //调用LCD操作库
#include "fontupdate.h"  //调用外部GBK汉字字库
#include "FONT.h"    //内部asc2库

//u32 mypow(u8 m,u8 n)
//{
//	u32 result=1;	 
//	while(n--)result*=m;    
//	return result;
//}

static void swap(u16 *a, u16 *b)
{
  u16 tmp;
  tmp = *a;
  *a = *b;
  *b = tmp;
}

//画点
void Draw_Point(u16 x,u16 y,u16 color)
{
	LCD_SetCursor(x,y);          //设置光标位置 
	Lcd_WriteData_16Bit(color); 
}

//画方框填充
void Draw_Fill_Rectangle(u16 sx,u16 sy,u16 ex,u16 ey,u16 color)
{  	
	u16 i,j;			
	u16 width=ex-sx+1; 		//得到填充的宽度
	u16 height=ey-sy+1;		//高度
	LCD_SetWindows(sx,sy,ex,ey);//设置显示窗口
	for(i=0;i<height;i++)
	{
		for(j=0;j<width;j++)
		Lcd_WriteData_16Bit(color);	//写入数据 	 
	}
	LCD_SetWindows(0,0,lcddev.width-1,lcddev.height-1);//恢复窗口设置为全屏
}

//画线
void Draw_Line(u16 x1, u16 y1, u16 x2, u16 y2)
{
	u16 t; 
	int xerr=0,yerr=0,delta_x,delta_y,distance; 
	int incx,incy,uRow,uCol; 

	delta_x=x2-x1; //计算坐标增量 
	delta_y=y2-y1; 
	uRow=x1; 
	uCol=y1; 
	if(delta_x>0)incx=1; //设置单步方向 
	else if(delta_x==0)incx=0;//垂直线 
	else {incx=-1;delta_x=-delta_x;} 
	if(delta_y>0)incy=1; 
	else if(delta_y==0)incy=0;//水平线 
	else{incy=-1;delta_y=-delta_y;} 
	if( delta_x>delta_y)distance=delta_x; //选取基本增量坐标轴 
	else distance=delta_y; 
	for(t=0;t<=distance+1;t++ )//画线输出 
	{  
		LCD_DrawPoint(uRow,uCol);//画点 
		xerr+=delta_x ; 
		yerr+=delta_y ; 
		if(xerr>distance) 
		{ 
			xerr-=distance; 
			uRow+=incx; 
		} 
		if(yerr>distance) 
		{ 
			yerr-=distance; 
			uCol+=incy; 
		} 
	}  
}

//画方框
void Draw_Rectangle(u16 x1, u16 y1, u16 x2, u16 y2)
{
	Draw_Line(x1,y1,x2,y1);
	Draw_Line(x1,y1,x1,y2);
	Draw_Line(x1,y2,x2,y2);
	Draw_Line(x2,y1,x2,y2);
}  


//画圆
void Draw_Circle(int xc, int yc,u16 c,int r, int fill)
{
	int x = 0, y = r, yi, d;

	d = 3 - 2 * r;


	if (fill) 
	{
		// 如果填充（画实心圆）
		while (x <= y) {
			for (yi = x; yi <= y; yi++)
				_draw_circle_8(xc, yc, x, yi, c);

			if (d < 0) {
				d = d + 4 * x + 6;
			} else {
				d = d + 4 * (x - y) + 10;
				y--;
			}
			x++;
		}
	} else 
	{
		// 如果不填充（画空心圆）
		while (x <= y) {
			_draw_circle_8(xc, yc, x, y, c);
			if (d < 0) {
				d = d + 4 * x + 6;
			} else {
				d = d + 4 * (x - y) + 10;
				y--;
			}
			x++;
		}
	}
}
//void _draw_circle_8(int xc, int yc, int x, int y, u16 c)
//{
//	Draw_Point(xc + x, yc + y, c);

//	Draw_Point(xc - x, yc + y, c);

//	Draw_Point(xc + x, yc - y, c);

//	Draw_Point(xc - x, yc - y, c);

//	Draw_Point(xc + y, yc + x, c);

//	Draw_Point(xc - y, yc + x, c);

//	Draw_Point(xc + y, yc - x, c);

//	Draw_Point(xc - y, yc - x, c);
//}

////画三角形
//void Draw_Triangel(u16 x0,u16 y0,u16 x1,u16 y1,u16 x2,u16 y2)
//{
//	Draw_Line(x0,y0,x1,y1);
//	Draw_Line(x1,y1,x2,y2);
//	Draw_Line(x2,y2,x0,y0);
//}

//填充三角形
void Draw_Fill_Triangel(u16 x0,u16 y0,u16 x1,u16 y1,u16 x2,u16 y2)
{
	u16 a, b, y, last;
	int dx01, dy01, dx02, dy02, dx12, dy12;
	long sa = 0;
	long sb = 0;
 	if (y0 > y1) 
	{
    swap(&y0,&y1); 
		swap(&x0,&x1);
 	}
 	if (y1 > y2) 
	{
    swap(&y2,&y1); 
		swap(&x2,&x1);
 	}
  if (y0 > y1) 
	{
    swap(&y0,&y1); 
		swap(&x0,&x1);
  }
	if(y0 == y2) 
	{ 
		a = b = x0;
		if(x1 < a)
    {
			a = x1;
    }
    else if(x1 > b)
    {
			b = x1;
    }
    if(x2 < a)
    {
			a = x2;
    }
		else if(x2 > b)
    {
			b = x2;
    }
		Draw_Fill_Rectangle(a,y0,b,y0,POINT_COLOR);
    return;
	}
	dx01 = x1 - x0;
	dy01 = y1 - y0;
	dx02 = x2 - x0;
	dy02 = y2 - y0;
	dx12 = x2 - x1;
	dy12 = y2 - y1;
	
	if(y1 == y2)
	{
		last = y1; 
	}
  else
	{
		last = y1-1; 
	}
	for(y=y0; y<=last; y++) 
	{
		a = x0 + sa / dy01;
		b = x0 + sb / dy02;
		sa += dx01;
    sb += dx02;
    if(a > b)
    {
			swap(&a,&b);
		}
		Draw_Fill_Rectangle(a,y,b,y,POINT_COLOR);
	}
	sa = dx12 * (y - y1);
	sb = dx02 * (y - y0);
	for(; y<=y2; y++) 
	{
		a = x1 + sa / dy12;
		b = x0 + sb / dy02;
		sa += dx12;
		sb += dx02;
		if(a > b)
		{
			swap(&a,&b);
		}
		Draw_Fill_Rectangle(a,y,b,y,POINT_COLOR);
	}
}

void Draw_Button(u16 x,u16 y,u16 color,u8 strcount,u8 fontsize)
{
	 POINT_COLOR=BLACK;
	 Draw_Line(x-1,y-1,x+strcount*8+1,y-1);
	 Draw_Line(x-1,y-1,x-1,y+fontsize+1);
	 Draw_Line(x-1,y+fontsize+1,x+strcount*8+1,y+fontsize+1);
	 Draw_Line(x+strcount*8+1,y-1,x+strcount*8+1,y+fontsize+1);
	 POINT_COLOR=GRAY;
	 Draw_Line(x-1,y+fontsize+2,x+strcount*8+2,y+fontsize+2);
	 Draw_Line(x+strcount*8+2,y-1,x+strcount*8+2,y+fontsize+2);
	 Draw_Fill_Rectangle(x,y,x+strcount*8,y+fontsize,color);
}

void ShowFontStrButton(u16 x,u16 y,u16 fc,u16 bc,u8* str,u8 size,u16 button_color)
{
	Draw_Button(x,y,button_color,strlen(str),size);
	ShowFontStr(x,y,fc,bc,str,size,1);
}



/*   字符显示部分    */
//单个字符显示
extern _font_info ftinfo; //外部字库信息
void ShowChar(u16 x,u16 y,u16 fc,u16 bc,u8 num,u8 size,u8 mode)
{  
  u8 temp;
  u8 pos,t;
	u16 colortemp=POINT_COLOR;   
		num=num-' ';//得到偏移后的值
		LCD_SetWindows(x,y,x+size/2-1,y+size-1);//设置单个文字显示窗口
    if(!mode) //非叠加方式
			{		
				for(pos=0;pos<size;pos++)
				{
					if(size==12)temp=asc2_1206[num][pos];//调用1206字体
					else temp=asc2_1608[num][pos];		 //调用1608字体
					for(t=0;t<size/2;t++)
						{                 
								if(temp&0x01)Lcd_WriteData_16Bit(fc); 
						    else Lcd_WriteData_16Bit(bc); 
						    temp>>=1; 
						
						}
				}	
			}
		else//叠加方式
			{
				for(pos=0;pos<size;pos++)
				{
					if(size==12)temp=asc2_1206[num][pos];//调用1206字体
					else temp=asc2_1608[num][pos];		 //调用1608字体
					for(t=0;t<size/2;t++)
						{   
						POINT_COLOR=fc;              
								if(temp&0x01)LCD_DrawPoint(x+t,y+pos);//画一个点    
								temp>>=1; 
						}
				}
			}

	POINT_COLOR=colortemp;	
	LCD_SetWindows(0,0,lcddev.width-1,lcddev.height-1);//恢复窗口为全屏    	   	 	  
}

////显示字符串
//void ShowString(u16 x,u16 y,u16 fc, u16 bc,u8 *p,u8 size,u8 mode)
//{         
//    while((*p<='~')&&(*p>=' '))//判断是不是非法字符!
//    {   
//		    if(x>(lcddev.width-1)||y>(lcddev.height-1))return; 	    
//        ShowChar(x,y,fc,bc,*p,size,mode);
//        x+=size/2;
//        p++;
//    }  
//} 

//显示数字
void ShowNum(u16 x,u16 y,u32 num,u8 len,u8 size)
{         	
	u16 t,temp;
	u8 enshow=0;						   
	for(t=0;t<len;t++)
	{
		temp=(num/mypow(10,len-t-1))%10;
		if(enshow==0&&t<(len-1))
		{
			if(temp==0)
			{
				ShowChar(x+(size/2)*t,y,POINT_COLOR,BACK_COLOR,' ',size,0);
				continue;
			}else enshow=1; 
		 	 
